apache/nuttx/arch/xtensa/src/esp32s2/esp32s2_wdt_lowerhalf.c
static struct esp32s2_wdt_lowerhalf_s g_esp32s2_rwdt_lowerhalf =
{
  .ops = &g_esp32s2_wdg_ops
};
#endif

#ifdef CONFIG_ESP32S2_XTWDT
/* XTWDT lower-half */

static struct esp32s2_wdt_lowerhalf_s g_esp32s2_xtwdt_lowerhalf =
{
  .ops = &g_esp32s2_wdg_ops,
};
#endif

/****************************************************************************
 * Name: wdt_lh_start
 *
 * Description:
 *   Start the watchdog timer, register a callback if there is one and
 *   enables interrupt, otherwise, configure it to reset system on
 *   expiration.
 *
 * Input Parameters:
 *   lower - A pointer the publicly visible representation of the
 *           "lower-half" driver state structure.
 *
 * Returned Values:
 *   Zero on success; a negated errno value on failure.
 *
 ****************************************************************************/

static int wdt_lh_start(struct watchdog_lowerhalf_s *lower)
{
  struct esp32s2_wdt_lowerhalf_s *priv =
    (struct esp32s2_wdt_lowerhalf_s *)lower;
  int ret = OK;

  wdinfo("Entry: wdt_lh_start\n");

  DEBUGASSERT(priv);

  if (priv->started)
    {
      /* Return EBUSY to indicate that the timer was already running */

      ret = -EBUSY;
    }

  /* If WDT was not started yet */

  else
    {
      irqstate_t flags;

      priv->started = true;

      /* Unlock WDT */

      ESP32S2_WDT_UNLOCK(priv->wdt);

      /* Re-apply the prescaler for MWDT in case the Timer Group
       * registers were reset after initialization (e.g. by a
       * constructor function that resets the peripheral).
       */

      if (priv->peripheral == TIMER)
        {
          ESP32S2_MWDT_PRE(priv->wdt, MWDT_CLK_PRESCALER_VALUE);
        }

      /* Re-apply the timeout value */

      if (priv->timeout > 0)
        {
          if (priv->peripheral == TIMER)
            {
              ESP32S2_WDT_STO(priv->wdt, MWDT_TIMEOUT_MS(priv->timeout),
                              ESP32S2_WDT_STAGE0);
            }
          else if (priv->peripheral == RTC)
            {
              uint16_t rtc_cycles = ESP32S2_RWDT_CLK(priv->wdt);
              ESP32S2_WDT_STO(priv->wdt, priv->timeout * rtc_cycles,
                              ESP32S2_WDT_STAGE0);
            }
        }

      /* No User Handler */

      if (priv->handler == NULL)
        {
          /* Then configure it to reset on wdt expiration */

          if (priv->peripheral == TIMER)
            {
              ESP32S2_WDT_STG_CONF(priv->wdt, ESP32S2_WDT_STAGE0,
                                   ESP32S2_WDT_STAGE_ACTION_RESET_SYSTEM);
            }
          else if (priv->peripheral == RTC)
            {
              ESP32S2_WDT_STG_CONF(priv->wdt, ESP32S2_WDT_STAGE0,
                                   ESP32S2_WDT_STAGE_ACTION_RESET_RTC);
            }
        }

      /* User handler was already provided */

      else
        {
          /* Then configure it to call the user handler on wdt expiration */

          ESP32S2_WDT_STG_CONF(priv->wdt, ESP32S2_WDT_STAGE0,
                               ESP32S2_WDT_STAGE_ACTION_INT);

          /* Set the lower-half handler and enable interrupt */

          flags = enter_critical_section();
          ESP32S2_WDT_SETISR(priv->wdt, wdt_handler, priv);
          leave_critical_section(flags);
          ESP32S2_WDT_ENABLEINT(priv->wdt);
        }

      ESP32S2_WDT_FEED(priv->wdt);

      flags = enter_critical_section();
      priv->lastreset = clock_systime_ticks();
      ESP32S2_WDT_START(priv->wdt);
      leave_critical_section(flags);

      /* Lock it again */

      ESP32S2_WDT_LOCK(priv->wdt);
    }

  return ret;
}

/****************************************************************************
 * Name: wdt_lh_stop
 *
 * Description:
 *   Stop the watchdog timer. In case a callback was previously configured,
 *   unregister and deallocate it.
 *
 * Input Parameters:
 *   lower - A pointer the publicly visible representation of the
 *           "lower-half" driver state structure.
 *
 ****************************************************************************/

static int wdt_lh_stop(struct watchdog_lowerhalf_s *lower)
{
  struct esp32s2_wdt_lowerhalf_s *priv =
    (struct esp32s2_wdt_lowerhalf_s *)lower;

  /* Unlock WDT */

  ESP32S2_WDT_UNLOCK(priv->wdt);

  /* Disable the WDT */

  ESP32S2_WDT_STOP(priv->wdt);

  /* In case there is some callback registered, disable and deallocate */

  if (priv->handler != NULL)
    {
      irqstate_t flags;

      ESP32S2_WDT_DISABLEINT(priv->wdt);

      flags = enter_critical_section();
      ESP32S2_WDT_SETISR(priv->wdt, NULL, NULL);
      leave_critical_section(flags);
    }

  /* Lock it again */

  ESP32S2_WDT_LOCK(priv->wdt);

  priv->started = false;

  return OK;
}

/****************************************************************************
 * Name: wdt_lh_keepalive
 *
 * Description:
 *   Reset the watchdog timer, prevent any
 *   imminent watchdog timeouts.  This is sometimes referred as "pinging"
 *   the watchdog timer or "petting the dog".
 *
 * Input Parameters:
 *   lower - A pointer the publicly visible representation of the
 *           "lower-half" driver state structure.
 *
 *
 ****************************************************************************/

static int wdt_lh_keepalive(struct watchdog_lowerhalf_s *lower)
{
  struct esp32s2_wdt_lowerhalf_s *priv =
    (struct esp32s2_wdt_lowerhalf_s *)lower;
  irqstate_t flags;

  wdinfo("Entry\n");

  /* Unlock */

  ESP32S2_WDT_UNLOCK(priv->wdt);

  /* Feed the dog and updates the lastreset variable */

  flags = enter_critical_section();
  priv->lastreset = clock_systime_ticks();
  ESP32S2_WDT_FEED(priv->wdt);
  leave_critical_section(flags);

  /* Lock */

  ESP32S2_WDT_LOCK(priv->wdt);

  return OK;
}

/****************************************************************************
 * Name: wdt_lh_getstatus
 *
 * Description:
 *   Get the current watchdog timer status
 *
 * Input Parameters:
 *   lower  - A pointer the publicly visible representation of
 *            the "lower-half" driver state structure.
 *   status - The location to return the watchdog status information.
 *
 ****************************************************************************/

static int wdt_lh_getstatus(struct watchdog_lowerhalf_s *lower,
                            struct watchdog_status_s *status)
{
  struct esp32s2_wdt_lowerhalf_s *priv =
    (struct esp32s2_wdt_lowerhalf_s *)lower;
  uint32_t ticks;
  uint32_t elapsed;

