apache/nuttx/arch/xtensa/src/esp32s2/esp32s2_wdt_lowerhalf.c
  /* Process the IOCTL command */

  switch (cmd)
    {
    case WDIOC_RSTCLK:
      ESP32S2_XTWDT_RST_CLK(priv->wdt);
      break;

    default:
      return -ENOTTY;
    }

  return OK;
}

/* Interrupt handling *******************************************************/

static int wdt_handler(int irq, void *context, void *arg)
{
  struct esp32s2_wdt_lowerhalf_s *priv =
    (struct esp32s2_wdt_lowerhalf_s *)arg;
  struct esp32s2_wdt_priv_s *wdt =
    (struct esp32s2_wdt_priv_s *)priv->wdt;

  /* Run the user callback */

  priv->handler(irq, context, priv->upper);

  /* Clear the Interrupt */

  ESP32S2_WDT_UNLOCK(priv->wdt);

  ESP32S2_WDT_ACKINT(priv->wdt);

  ESP32S2_WDT_LOCK(priv->wdt);

  return OK;
}

/****************************************************************************
 * Name: wdt_lh_xt_calculate
 *
 * Description:
 *   Calculate the actual frequency of RC_SLOW_CLK to calibrate the backup
 *   RTC_SLOW_CLK. This is necessary to compensate for clock deviations.
 *
 * Input Parameters:
 *   rtc_clk_frequency_khz - Frequency of RTC SLOW CLK in khz
 *
 * Returned Values:
 *   The divisor of BACKUP32K_CLK used to calibrate the RTC_SLOW_CLK
 *   according to the actual frequency of the RC_SLOW_CLK.
 *
 ****************************************************************************/
#ifdef CONFIG_ESP32S2_XTWDT_BACKUP_CLK_ENABLE
static uint32_t wdt_lh_xt_calculate(uint32_t rtc_clk_frequency_khz)
{
    uint32_t xtal32k_clk_factor = 0;
    uint8_t divisor_comps[XT_WDT_DIV_COMP_N_MAX];

    uint8_t M = ((rtc_clk_frequency_khz / 32) / 2);
    uint32_t S = ((4 * rtc_clk_frequency_khz) / 32);

    memset(divisor_comps, M, XT_WDT_DIV_COMP_N_MAX);

    /* Calculate how far we are away from satisfying S = SUM(x_n) */

    uint8_t off = S - XT_WDT_DIV_COMP_N_MAX * M;

    /* Offset should never be this big */

    ASSERT(off <= XT_WDT_DIV_COMP_N_MAX);

    for (int i = 0; i < XT_WDT_DIV_COMP_N_MAX; i++)
      {
        if (off)
          {
            divisor_comps[i]++;
            off--;
          }

        /* Sum up all divisors */

        xtal32k_clk_factor |=  (divisor_comps[i] << 4 * i);
      }

    return xtal32k_clk_factor;
}

/****************************************************************************
 * Name: wdt_lh_clk_freq_cal
 *
 * Description:
 *   Calculate the clock frequency from period in microseconds.
 *
 * Input Parameters:
 *   rtc_clk_period_us - Average slow clock period in microseconds.
 *
 * Returned Values:
 *   Frequency of the clock in Hz.
 *
 ****************************************************************************/

static uint32_t wdt_lh_clk_freq_cal(uint32_t rtc_clk_period_us)
{
  if (rtc_clk_period_us == 0)
    {
      return 0;
    }

  return 1000000ULL * (1 << RTC_CLK_CAL_FRACT) / rtc_clk_period_us;
}
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32s2_wdt_initialize
 *
 * Description:
 *   Initialize the watchdog timer.  The watchdog timer is initialized
 *   and registered as 'devpath'.
 *
 * Input Parameters:
 *   devpath                 - The full path to the watchdog.  This should
 *                             be of the form /dev/watchdogX
 *   wdt                     - WDT instance to be initialized.
 *
 * Returned Values:
 *   Zero (OK) is returned on success; a negated errno value is returned on
 *   any failure.
 *
 ****************************************************************************/

int esp32s2_wdt_initialize(const char *devpath, enum esp32s2_wdt_inst_e wdt)
{
  struct esp32s2_wdt_lowerhalf_s *lower = NULL;
  int                             ret = OK;

  DEBUGASSERT(devpath);

  switch (wdt)
    {
#ifdef CONFIG_ESP32S2_MWDT0
      case ESP32S2_WDT_MWDT0:
        {
          lower = &g_esp32s2_mwdt0_lowerhalf;
          lower->peripheral = TIMER;
          break;
        }
#endif

#ifdef CONFIG_ESP32S2_MWDT1
      case ESP32S2_WDT_MWDT1:
        {
          lower = &g_esp32s2_mwdt1_lowerhalf;
          lower->peripheral = TIMER;
          break;
        }
#endif

#ifdef CONFIG_ESP32S2_RWDT
      case ESP32S2_WDT_RWDT:
        {
          lower = &g_esp32s2_rwdt_lowerhalf;
          lower->peripheral = RTC;
          break;
        }
#endif

#ifdef CONFIG_ESP32S2_XTWDT
      case ESP32S2_WDT_XTWDT:
        {
          lower = &g_esp32s2_xtwdt_lowerhalf;
          lower->peripheral = XTAL32K;
          break;
        }
#endif

      default:
        {
          ret = -ENODEV;
          goto errout;
        }
    }

  /* Initialize the elements of lower-half state structure */

  lower->handler = NULL;
  lower->timeout = 0;
  lower->wdt     = esp32s2_wdt_init(wdt);

  if (lower->wdt == NULL)
    {
      ret = -EINVAL;
      goto errout;
    }

  lower->started = esp32s2_wdt_is_running(lower->wdt);

  ESP32S2_WDT_UNLOCK(lower->wdt);

  /* If it is a Main System Watchdog Timer configure the Prescale to
   * have a 500us period.
   */

  if (lower->peripheral == TIMER)
    {
      ESP32S2_MWDT_PRE(lower->wdt, MWDT_CLK_PRESCALER_VALUE);
    }

  /* Configure auto backup clock when XTAL32K fails */

#ifdef CONFIG_ESP32S2_XTWDT_BACKUP_CLK_ENABLE
  if (lower->peripheral == XTAL32K)
    {
      /* Estimate frequency of internal RTC oscillator */

      uint32_t rtc_clk_period_us =
        esp32s2_rtc_clk_cal(RTC_CAL_INTERNAL_OSC, XT_WDT_CLK_CAL_CYCLES);

      uint32_t rtc_clk_frequency_khz = wdt_lh_clk_freq_cal(rtc_clk_period_us)
        / 1000;

      uint32_t xtal32k_clk_factor =
        wdt_lh_xt_calculate(rtc_clk_frequency_khz);

      ESP32S2_XTWDT_PRE(lower->wdt, xtal32k_clk_factor);
    }
#endif

  ESP32S2_WDT_LOCK(lower->wdt);

  /* Register the watchdog driver as /dev/watchdogX. If the registration goes
   * right the returned value from watchdog_register is a pointer to
   * watchdog_upperhalf_s that can be either used with watchdog_unregister()
   * or with the handler's arg.
   */

  lower->upper = watchdog_register(devpath,
                                   (struct watchdog_lowerhalf_s *)lower);
  if (lower->upper == NULL)
    {
      /* The actual cause of the failure may have been a failure to allocate
       * perhaps a failure to register the watchdog driver (such as if the
       * 'devpath' were not unique).  We know here but we return EEXIST to
       * indicate the failure (implying the non-unique devpath).
       */

      ret = -EEXIST;
    }

errout:
  return ret;
}
